Pandas 09 - Membagi Data Frame Menjadi Dua Secara Acak
Import Modules

In [1]:
import pandas as pd
import numpy as np

# Cek Versi
print(pd.__version__)
print(np.__version__)

2.3.3
2.3.0

In [2]:
#Persiapan Data Frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  18   8  11   6  12
1   5  19   9   1  18
2  19   6   7  19  17
3   8  17  16  13   8
4   9  13   8  17  14
5   8  16   8  16  14
6   5   8  18   4  13
7   2  13  19   7  12
8  17  15   7   6  14
9   4   8   9  12   1

Membagi Data Frame Menjadi Dua Secara Acak Berdasarkan Proporsi Tertentu

In [3]:
# Menggunakan atribut shape untuk menampilkan dimensi (jumlah baris dan kolom) dari data frame
df.shape

(10, 5)

In [4]:
# Menetapkan proporsi sebagai 0.7, yang akan digunakan untuk membagi data frame menjadi dua subset
proporsi = 0.7

# Menggunakan metode sample untuk mengambil sebagian data frame sesuai dengan proporsi yang ditentukan
df_1 = df.sample(frac=proporsi)

# Menggunakan metode drop untuk menghapus baris-baris yang telah dipilih dalam df_1 dari data frame utama df
df_2 = df.drop(df_1.index)

# Menampilkan dimensi (jumlah baris dan kolom) dari kedua subset data frame
print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [5]:
# Menampilkan subset pertama (df_1) dari data frame, yang dihasilkan dengan metode sample
df_1

    A   B   C   D   E
5   8  16   8  16  14
6   5   8  18   4  13
4   9  13   8  17  14
2  19   6   7  19  17
7   2  13  19   7  12
1   5  19   9   1  18
3   8  17  16  13   8

In [6]:
# Menampilkan subset kedua (df_2) dari data frame, yang dihasilkan dengan metode drop
df_2

    A   B   C   D   E
0  18   8  11   6  12
8  17  15   7   6  14
9   4   8   9  12   1